# Introduction


Our group decided to make an ER diagram on our idea of a fast food restaurant. As many people stop by for a quick bite or easy meal we thought it would be interesting to try to create and look at data and relationships in a common experience. We started by creating five tables to create the diagram. We chose to use Employee, Order, Menu, Ingredients, and Transactions. Each table has attributes that shape our data. For example, the Employee table has an EmployeeID (the primary key), first name, last name, wage, job type, and shift. We linked the tables together with different types of relationships such as one-to-one, one-to-many, zero-to-many, etc. depending on the best fit for the tables. For instance, the Employee table and the Order table are linked together to show that an Employee can take from 0 to 500 orders and it only takes 1 employee to make 1 order. After doing this for each of the five tables we essentially got to what our ER diagram looks like now. We also labeled foreign keys and primary keys for each table.

# ER Diagram

![alt text](https://raw.githubusercontent.com/ejm5763/IST210/master/IST210%20Group%20Project%20Restaurant%20Data%20Model.jpg)

# ER Diagram Specifics

For our ER diagram our group used Employee, Order, Menu, Ingredients, and Transaction Time to be data to focus our tables around. For the Employee table the attributes are EmployeeID, First Name, Last Name, Wage, Job Type, and Shift. We linked this to the Order table with Employees being able to take 0 to 500 orders per shift and Orders to Employees as a 1-to-1 relationship since 1 order can be taken by 1 employee at a time. The order table’s attributes are OrderID, Number, Order Items, Order Type, and Number of Items. This table is also connected to the Menu and table through the Order Items attribute with a 0-to-Many relationship limiting orders to 20 items max. The menu table’s attributes are Menu Items ID, Menu Type, Meal Type, and Costs. Since some restaurants have food items available only during breakfast, we chose to have a menu type attribute. The meal type attribute is similar to how restaurants offer combo meals. The menu table is also connected to the Ingredients table which has Ingredient ID, Ingredient Cost, and Ingredient Inventory as attributes. The Ingredient Cost is a foreignn key linked to the Costs attribute of the Menu table since the cost it is for a restaurant to make a dish could influence the price on the menu. Finally the Transactions table is connected to both the Order and Ingredients tables. Its attributes are Order Time, Season, Day, and IDNumber. It’s connected to the Ingredients table using season since season can influence what ingredients are available.

 #Database Table Construction

For our database we made some slight adjustments to get our ER diagram to where it is now. An example was we added a connection between Transactions and Order to be able to join tables and track when orders were made. We also edited our ER diagram to become First Normal Form. For instance we originally just had employee names as one attribute rather than split up but, we separated it into first and last names. Also another change we made was having to change the table name for Orders since SQL has statements similar to “Order” so we changed the table to CustomerOrder to be able to insert data.

# New Code

In [258]:
%load_ext sql
%sql sqlite:///restaurant.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @restaurant.db'

In [259]:
%%sql
DROP TABLE IF EXISTS Employee;
CREATE TABLE Employee (EmployeeID text PRIMARY KEY, FirstName text, LastName text, Wage real, JobType text, Shift text);
DROP TABLE IF EXISTS CustomerOrder;
CREATE TABLE CustomerOrder (OrderIDNumber text PRIMARY KEY, OrderItems text, NumberoFItems integer);
DROP TABLE IF EXISTS Menu;
CREATE TABLE Menu (MenuItemsID text PRIMARY KEY, MenuType text, MealType text, Costs real);
DROP TABLE IF EXISTS Ingredients;
CREATE TABLE Ingredients (IngredientID text PRIMARY KEY, IngredientCost real, IngredientInventory integer);
DROP TABLE IF EXISTS Transactions;
CREATE TABLE Transactions (OrderTime text PRIMARY KEY, Season text, Day text, IDNumber text);

 * sqlite:///restaurant.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [260]:
%%sql
insert into Employee values ("12345", "John", "Doe", 7.50, "Cashier", "Morning");
insert into Employee values ("45678", "Anthony", "Smith", 9.00, "Cook", "Morning");
insert into Employee values ("36913", "Jane", "Doe", 7.25, "Cook", "Afternoon");
insert into Employee values ("55901", "Susan", "Thomas", 7.50, "Cashier", "Afternoon");
insert into Employee values ("88228", "Sally", "Smith", 7.25, "Cook", "Evening");
insert into Employee values ("24680", "Michael", "Scott", 9.00, "Shift Manager", "Evening");
insert into Employee values ("96822", "Jim", "Jay", 7.25, "Cook", "Morning");
insert into Employee values ("58481", "Mark", "Peters", 7.50, "Cashier", "Morning");
insert into Employee values ("10295", "Susan", "Roberts", 7.25, "Cook", "Morning");
insert into Employee values ("25810", "Jacob", "Piper", 6.45, "Cook", "Morning");
insert into Employee values ("10205", "Jessica", "Hoffman", 9.00, "Shift Manager", "Morning");
insert into Employee values ("20591", "Rachel", "Ray", 6.45, "Cook", "Morning");
insert into Employee values ("20511", "Ryan", "Ray", 7.50, "Cashier", "Morning");
insert into Employee values ("23591", "Joseph", "Duncan", 9.00, "Shift Manager", "Morning");

 * sqlite:///restaurant.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [261]:
%%sql
insert into CustomerOrder values ("72", "Burger, Fries, Coffee", 3);
insert into CustomerOrder values ("73", "Sandwich, Water", 2);
insert into CustomerOrder values ("74", "Fries", 1);
insert into CustomerOrder values ("75", "Burger, Burger, Burger, Sandwich, Fries, Fries, Fries, Soda, Soda, Lemonade", 10);
insert into CustomerOrder values ("76", "Chicken Nuggets, Fries", 2);

 * sqlite:///restaurant.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [262]:
%%sql
insert into Menu values ("08", "Breakfast", "Combo", 6.25);
insert into Menu values ("05", "Lunch", "Regular", 7.50);
insert into Menu values ("01", "Lunch", "Regular", 1.35);
insert into Menu values ("10", "Dinner", "Combo", 9.35);
insert into Menu values ("03", "Dinner", "Combo", 5.65);

 * sqlite:///restaurant.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [263]:
%%sql
insert into Ingredients values ("ON1ON", 47.00, 19);
insert into Ingredients values ("B33F", 71.90, 37 );
insert into Ingredients values ("T0M4T", 58.52, 24);
insert into Ingredients values ("P0T4T", 50.87, 20);
insert into Ingredients values ("CH1CK", 61.26, 22);

 * sqlite:///restaurant.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [264]:
%%sql
insert into Transactions values ("07:35:01", "Winter", "Monday", "01" );
insert into Transactions values ("12:25:20", "Summer", "Friday", " 70");
insert into Transactions values ("13:12:31", "Summer", "Friday", "80");
insert into Transactions values ("07:01:56", "Fall", "Wednesday", "10");
insert into Transactions values ("18:14:21", "Fall", "Wednesday", "72");
insert into Transactions values ("20:12:03", "Fall", "Wednesday", "73");
insert into Transactions values ("17:24:01", "Fall", "Wednesday","74");
insert into Transactions values ("20:20:10", "Fall", "Wednesday","75");
insert into Transactions values ("19:20:02", "Fall", "Wednesday","76");
insert into Transactions values ("20:01:10", "Fall", "Thursday", "81");
insert into Transactions values ("18:32:10", "Fall", "Friday", "99");

 * sqlite:///restaurant.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#Scenario

Karen Doe walks into the restaurant around 8PM on a Wednesday night after her soccer game and is starving. She wants to be in and out as fast as possible since she has school early tomorrow morning. She decides to order her usual post-game meal which is the dinner combo, a burger, fries, and soda. Usually there's a bit of a wait but this time she has been waiting for her food for the last hour and a half. It's pretty crowded but its supposed to be a fast food restaurant, right? Just as Sally is about to storm out her order number is called and she takes her food from an employee who looks extremely busy and stressed. Hangrily she snatches her food and leaves, pulling out her phone to leave a 1 Star Yelp review.

#Queries

1. All starting employees start with a wage lower than 7.00 and must receive training. Are there any new employees and what training do they need according to their job?

Answer: Jacob Piper and Rachel Ray are new employees. A restaurant owner could use this information to determine which employees need training outside of work to make working during shifts more efficient.

In [265]:
%%sql
Select * from Employee WHERE Wage < 7.00

 * sqlite:///restaurant.db
Done.

[('25810', 'Jacob', 'Piper', 6.45, 'Cook', 'Morning'),
 ('20591', 'Rachel', 'Ray', 6.45, 'Cook', 'Morning')]

2. The last scheduling manager quit angrily and messed up all of the schedules. Now the employees for the dinner shift have been complaining about being spread too thin during their shift. Which shift has too many employees working at one time and which employees can be moved without losing efficiency in shifts? (There should be 1 shift manager, at least 1 cashier, and at least 2 cooks per shift.)

Answer: The morning shift is overbooked. One option would be for Anthony Smith and Jessica Hoffman moved to the afternoon shift and Jim Jay and John Doe could be moved to the evening shift. This would be useful information for the employer so they can fix the schedule and see why the dinner employees were stressed.

In [266]:
%%sql
Select shift, FirstName, LastName, JobType from Employee ORDER BY Shift

 * sqlite:///restaurant.db
Done.

[('Afternoon', 'Jane', 'Doe', 'Cook'),
 ('Afternoon', 'Susan', 'Thomas', 'Cashier'),
 ('Evening', 'Sally', 'Smith', 'Cook'),
 ('Evening', 'Michael', 'Scott', 'Shift Manager'),
 ('Morning', 'John', 'Doe', 'Cashier'),
 ('Morning', 'Anthony', 'Smith', 'Cook'),
 ('Morning', 'Jim', 'Jay', 'Cook'),
 ('Morning', 'Mark', 'Peters', 'Cashier'),
 ('Morning', 'Susan', 'Roberts', 'Cook'),
 ('Morning', 'Jacob', 'Piper', 'Cook'),
 ('Morning', 'Jessica', 'Hoffman', 'Shift Manager'),
 ('Morning', 'Rachel', 'Ray', 'Cook'),
 ('Morning', 'Ryan', 'Ray', 'Cashier'),
 ('Morning', 'Joseph', 'Duncan', 'Shift Manager')]

3. The dinner shift starts at 5PM. Which items are bought most often during Wednesday, the busiest dinner shift?

Answer: Burgers, Fries, and Sodas are the most commonly bought items. This could be  useful for restaurant owners to make sure that they have enough ingredients in stock to keep up with the busy shift. This also could be useful for customers like Karen in case she wants to order something that isn't being bought at a high rate that night.

In [267]:
%%sql
Select * from CustomerOrder c LEFT JOIN Transactions t ON c.OrderIDNumber = t.IDNumber WHERE OrderTime > "17:00:00"

 * sqlite:///restaurant.db
Done.

[('72', 'Burger, Fries, Coffee', 3, '18:14:21', 'Fall', 'Wednesday', '72'),
 ('73', 'Sandwich, Water', 2, '20:12:03', 'Fall', 'Wednesday', '73'),
 ('74', 'Fries', 1, '17:24:01', 'Fall', 'Wednesday', '74'),
 ('75', 'Burger, Burger, Burger, Sandwich, Fries, Fries, Fries, Soda, Soda, Lemonade', 10, '20:20:10', 'Fall', 'Wednesday', '75'),
 ('76', 'Chicken Nuggets, Fries', 2, '19:20:02', 'Fall', 'Wednesday', '76')]